backend/perf/results/hold-lua-snapshot-valid-100-2-k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: perf/booking-preauthenticated.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 5m30s max duration (incl. graceful stop):
              * booking_preauthenticated: 1 iterations for each of 100 VUs (maxDuration: 5m0s, gracefulStop: 30s)


running (0m00.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m00.7s/5m0s  000/100 iters, 1 per VU

running (0m01.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m01.7s/5m0s  000/100 iters, 1 per VU

running (0m02.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m02.7s/5m0s  000/100 iters, 1 per VU

running (0m03.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m03.7s/5m0s  000/100 iters, 1 per VU

running (0m04.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m04.7s/5m0s  000/100 iters, 1 per VU

running (0m05.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m05.7s/5m0s  000/100 iters, 1 per VU

running (0m06.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m06.7s/5m0s  000/100 iters, 1 per VU

running (0m07.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m07.7s/5m0s  000/100 iters, 1 per VU

running (0m08.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m08.7s/5m0s  000/100 iters, 1 per VU

running (0m09.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m09.7s/5m0s  000/100 iters, 1 per VU

running (0m10.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m10.7s/5m0s  000/100 iters, 1 per VU

running (0m11.7s), 100/100 VUs, 0 complete and 0 interrupted iterations
booking_preauthenticated   [   0% ] 100 VUs  0m11.7s/5m0s  000/100 iters, 1 per VU


  █ TOTAL RESULTS 

    CUSTOM
    expected_business_conflicts....: 0.00%  0 out of 100
    hold_latency_ms................: min=1.18s   avg=3.34s  med=3.19s  p(90)=4.44s  p(95)=4.66s  p(99)=8.64s  max=8.93s 
    unexpected_failures............: 0.00%  0 out of 100

    HTTP
    http_req_duration..............: min=218.3ms avg=3.08s  med=1.4s   p(90)=6.39s  p(95)=7.48s  p(99)=8.94s  max=9.31s 
      { expected_response:true }...: min=218.3ms avg=3.08s  med=1.4s   p(90)=6.39s  p(95)=7.48s  p(99)=8.94s  max=9.31s 
    http_req_failed................: 0.00%  0 out of 500
    http_reqs......................: 500    40.731356/s

    EXECUTION
    iteration_duration.............: min=12.14s  avg=12.21s med=12.22s p(90)=12.23s p(95)=12.24s p(99)=12.26s max=12.27s
    iterations.....................: 100    8.146271/s
    vus............................: 100    min=100      max=100
    vus_max........................: 100    min=100      max=100

    NETWORK
    data_received..................: 60 MB  4.9 MB/s
    data_sent......................: 299 kB 24 kB/s



running (0m12.3s), 000/100 VUs, 100 complete and 0 interrupted iterations
booking_preauthenticated ✓ [ 100% ] 100 VUs  0m12.3s/5m0s  100/100 iters, 1 per VU